In [1]:
# github.com/echtr

In [2]:
import numpy as np
import pandas as pd

In [6]:
m = np.random.randint(1, 100, size = (10, 3))
df = pd.DataFrame(m, columns = ["v1", "v2", "v3"])
df

   v1  v2  v3
0  25  79  73
1  15   8   4
2  42  57  23
3  29  48  44
4  59  77   9
5  67  15   4
6  32  90  18
7  63  32  25
8   4  17  12
9  45  96  54

In [7]:
df["v1"]

0    25
1    15
2    42
3    29
4    59
5    67
6    32
7    63
8     4
9    45
Name: v1, dtype: int32

In [8]:
df.v1

0    25
1    15
2    42
3    29
4    59
5    67
6    32
7    63
8     4
9    45
Name: v1, dtype: int32

In [9]:
df.v1 == df.v2

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [10]:
df.v4 = df.v1
df.v4 == df.v1

C:\Users\pc\AppData\Local\Temp/ipykernel_7208/1499664916.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.v4 = df.v1

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: v1, dtype: bool

In [15]:
df[df.v1 > 30]

   v1  v2  v3
2  42  57  23
4  59  77   9
5  67  15   4
6  32  90  18
7  63  32  25
9  45  96  54

In [16]:
df[df.v1 > 30]["v1"]

2    42
4    59
5    67
6    32
7    63
9    45
Name: v1, dtype: int32

In [18]:
df[(df.v1 > 30) & (df.v3 < 50)] # v1 sütununda 30dan büyük değerlere ve v3 sütununda 100den küçük değerlere sahip olan
# satırları göster

   v1  v2  v3
2  42  57  23
4  59  77   9
5  67  15   4
6  32  90  18
7  63  32  25

In [19]:
df.loc[(df.v1 > 15), ["v1","v2"]] # v1 sütununda 15ten büyük değere sahip olan satırları ve v1 ile v2 sütunlarını seç.

   v1  v2
0  25  79
2  42  57
3  29  48
4  59  77
5  67  15
6  32  90
7  63  32
9  45  96